; Wise Memory Optimizer x32 ja x64 versioille
; Älä käännä kohtaa 'ReadHabit=Left-to-right' mutta voit päivittää sen jos alkuperäinen kielesi on 'Right-to-left'.
; TranslationAuthor: original finnish; penaV
; TranslationAuthorEmail: penav@outlook.com
; Soft Version: 4.2.2.128
; Lang. Update: 2024-Oct-06
[Lang]
NativeLanguage=Finnish-Suomi

[GUI]
ButtonYes=Kyllä
ButtonNo=Ei
ButtonOK=OK
ButtonClose=Sulje
BtnNews=Viestit
[Translation]
LangCode=040B
ReadHabit=Left-to-right
LanguageName=FIN
LangShortName=fi-fi
DefaultFont=Tahoma
DefaultFontSize=8
DefaultCharset=ANSI_CHARSET
Information=Viestit
Warning=Varoitukset
Error=Virhe
Confirm=Vahvista
FrmMOMain.ckperiod.caption=Tehosta muistia joka:

;
; Memory Optimization - Muistin Tehostus
;
FrmMoMain.imgmail.hint=Jaa Wise Memory Optimizeria ystävillesi
FrmMoMain.imgfacebook.hint=Tykkää Wise Cleaneristä Facebookissa
FrmMoMain.imgtwitter.hint=Jaa Wise Memory Optimizeria Twitterissä
FrmMoMain.chkupdate.caption=Auto tarkista uusin versio.
FrmMoMain.btnlike.caption=Tykkää
FrmMoMain.lblTotalMem.Caption=Muisti Koko:
FrmMoMain.lblaopt.Caption=Auto Tehosta mikäli muistia on alle:  
FrmMoMain.lbltry.Caption=Vapauta lisää muistia
FrmMoMain.btnsettings.Caption=Asetukset
FrmMoMain.btnOpt.Caption=Tehosta Nyt
FrmMoMain.chkmin.Caption=Pienennä ilmaisin alueelle
FrmMoMain.chkauto.Caption=Suorita kun Windows käynnistyy
FrmMoMain.chkautoOpt.Caption=Salli Auto Tehostus
FrmMoMain.ckchkclearborad.Caption=Tyhjennä Leikepöytä tehostuksen aikana
FrmMoMain.chkidle.Caption=Suorita kun Prosessori on jouten. (Suositus)
FrmMoMain.lbllang.Caption=Kieli:
FrmMOMain.cknotice.caption=Näytä ilmoitus tehostuksen jälkeen
FrmMOMain.ckMode.caption=Tumma tila
;
; About - Tietoja
;
FrmAbout.caption=Tietoja Ohjelmasta ja Meistä
FrmAbout.btnok.caption=OK
FrmAbout.lblver.caption=Nykyinen Versio:
FrmAbout.lblemail.caption=Tuen Sähköposti:
FrmAbout.lblhome.caption=Kotisivulle:
FrmAbout.lblthanks.caption=Kiitos seuraaville henkilöille heidän avusta:
FrmAbout.lblUninstall.caption=Poisto ohje
FrmAbout.lblPolicy.caption=Tietosuojakäytäntö
FrmAbout.lblEula.caption= EULA Loppukäyttäjän lisenssisopimus
FrmMOMain.ckShutkey.caption=Pikanäppäin
FrmMOMain.btn2.hint=Pikanäppäin ristiriidat
ShutkeyCA=CTRL+ALT
ShutkeyAS=ALT+SHIFT 
ShutkeyCS=CTRL+SHIFT
[MemoryOptimizer]
ThisTimeFreeMemory=Muistia vapautui %s tällä kerralla.
CurPrecent=Nykyinen Muistin Käytön määrä:
UsedMemory=Muistia Käytössä:
AvailableMemory=Muistia Saatavilla:
FreeMemory=Muistia Vapautui:
At=Kello 
pmShow=Näytä Pääohjelma Ikkuna
pmOpt=Tehosta Nyt
pmAbout=Tietoja Meistä
pmExit=Poistu
SureExit=Tehostetaan Muistin käyttöä, oletko varma että halauat poistua nyt?
Mintotray=Tehostetaan Muistin käyttöä
pmdefragmem=Eheytä muisti
pmclearmem=Tyhjennä muisti
pmclearstandbymem=Tyhjennä valmiustilan muisti

[Message]
NoNews=Sinulla ei ole lukemattoimia viestejä.
NewVer=Uusi versio saatavilla! Haluatko päivittää siihen nyt?
NotShowNotice=Älä näytä tätä huomautusta uudelleen.
NoOptItem= Sinun tulee valita vähintään yksi tehostus menetelmä tehostukseen.
minutes=min. välein
hours=tunnin välein

[feedback]
InvalidEmail=Anna oikea sähköpostiosoite.
emptyinput=Ole hyvä ja syötä jotain lähetettäväksi.
thanks=Kiitos palautteestasi!
FrmFeedback.lblfeedback.caption = Miten arvioit %s?
FrmFeedback.lblemail.caption = Sähköpostiosoite:
FrmFeedback.lblgood.caption = Mistä ominaisuudesta pidät eniten?
FrmFeedback.lblbad.caption = Mistä ominaisuudesta pidät vähiten?
FrmFeedback.lblwant.caption = Mitä uutta ominaisuutta haluat eniten?
FrmFeedback.btncancel.caption = En tällä kerralla
FrmFeedback.btnsubmit.caption = Lähetä